Question 3: - Write a program, which would download the data from the provided link, and then read the data and convert that into properly structured data and return it in Excel format.

In [1]:
url1='https://raw.githubusercontent.com/Biuni/PokemonGO-Pokedex/master/pokedex.json'

In [2]:
urll='url_new.json'

In [3]:
import pandas as pd

In [4]:
import wget
wget.download(url1,urll)   #downloading json dataset

100% [..............................................................................] 81998 / 81998

'url_new (2).json'

In [5]:
df1=pd.read_json('url_new.json')    #reading json dataset

In [6]:
excel='excel_file.xlsx'

In [7]:
df1.to_excel('excel_file.xlsx')    #converting json file dataset to excel format

In [8]:
df1      #dataset in excel format

                                               pokemon
0    {'id': 1, 'num': '001', 'name': 'Bulbasaur', '...
1    {'id': 2, 'num': '002', 'name': 'Ivysaur', 'im...
2    {'id': 3, 'num': '003', 'name': 'Venusaur', 'i...
3    {'id': 4, 'num': '004', 'name': 'Charmander', ...
4    {'id': 5, 'num': '005', 'name': 'Charmeleon', ...
..                                                 ...
146  {'id': 147, 'num': '147', 'name': 'Dratini', '...
147  {'id': 148, 'num': '148', 'name': 'Dragonair',...
148  {'id': 149, 'num': '149', 'name': 'Dragonite',...
149  {'id': 150, 'num': '150', 'name': 'Mewtwo', 'i...
150  {'id': 151, 'num': '151', 'name': 'Mew', 'img'...

[151 rows x 1 columns]

In [9]:
df1.head(10)

                                             pokemon
0  {'id': 1, 'num': '001', 'name': 'Bulbasaur', '...
1  {'id': 2, 'num': '002', 'name': 'Ivysaur', 'im...
2  {'id': 3, 'num': '003', 'name': 'Venusaur', 'i...
3  {'id': 4, 'num': '004', 'name': 'Charmander', ...
4  {'id': 5, 'num': '005', 'name': 'Charmeleon', ...
5  {'id': 6, 'num': '006', 'name': 'Charizard', '...
6  {'id': 7, 'num': '007', 'name': 'Squirtle', 'i...
7  {'id': 8, 'num': '008', 'name': 'Wartortle', '...
8  {'id': 9, 'num': '009', 'name': 'Blastoise', '...
9  {'id': 10, 'num': '010', 'name': 'Caterpie', '...